In [1]:
import pandas as pd

In [2]:
data = pd.DataFrame({
    'date': pd.date_range(start='2024-01-01', periods=14),
    'category': ['A', 'B'] * 7,
    'sales': [120, 80, 150, 90, 130, 100, 170, 110, 160, 105, 180, 115, 175, 120]
})

data

         date category  sales
0  2024-01-01        A    120
1  2024-01-02        B     80
2  2024-01-03        A    150
3  2024-01-04        B     90
4  2024-01-05        A    130
5  2024-01-06        B    100
6  2024-01-07        A    170
7  2024-01-08        B    110
8  2024-01-09        A    160
9  2024-01-10        B    105
10 2024-01-11        A    180
11 2024-01-12        B    115
12 2024-01-13        A    175
13 2024-01-14        B    120

In [3]:
data.isnull().sum()

date        0
category    0
sales       0
dtype: int64

In [4]:
daily_sales = data.groupby('date')['sales'].sum().reset_index()

daily_sales

         date  sales
0  2024-01-01    120
1  2024-01-02     80
2  2024-01-03    150
3  2024-01-04     90
4  2024-01-05    130
5  2024-01-06    100
6  2024-01-07    170
7  2024-01-08    110
8  2024-01-09    160
9  2024-01-10    105
10 2024-01-11    180
11 2024-01-12    115
12 2024-01-13    175
13 2024-01-14    120

In [5]:
daily_sales['rolling_mean_7d'] = daily_sales['sales'].rolling(window=7).mean()

daily_sales

         date  sales  rolling_mean_7d
0  2024-01-01    120              NaN
1  2024-01-02     80              NaN
2  2024-01-03    150              NaN
3  2024-01-04     90              NaN
4  2024-01-05    130              NaN
5  2024-01-06    100              NaN
6  2024-01-07    170       120.000000
7  2024-01-08    110       118.571429
8  2024-01-09    160       130.000000
9  2024-01-10    105       123.571429
10 2024-01-11    180       136.428571
11 2024-01-12    115       134.285714
12 2024-01-13    175       145.000000
13 2024-01-14    120       137.857143

In [6]:
daily_sales

         date  sales  rolling_mean_7d
0  2024-01-01    120              NaN
1  2024-01-02     80              NaN
2  2024-01-03    150              NaN
3  2024-01-04     90              NaN
4  2024-01-05    130              NaN
5  2024-01-06    100              NaN
6  2024-01-07    170       120.000000
7  2024-01-08    110       118.571429
8  2024-01-09    160       130.000000
9  2024-01-10    105       123.571429
10 2024-01-11    180       136.428571
11 2024-01-12    115       134.285714
12 2024-01-13    175       145.000000
13 2024-01-14    120       137.857143